Autodesk.Revit.DB.Electrical.WireSizeSet
A set that contains wire sizes.

Autodesk.Revit.DB.Electrical.WireSizeSet.Insert(Autodesk.Revit.DB.Electrical.WireSize)
System.Int32
Insert the specified wire size into the set.
item: The wire size to be inserted into the set.
Returns: Returns whether the wire size was inserted into the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.WireSizeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.WireSizeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.Erase(Autodesk.Revit.DB.Electrical.WireSize)
System.Int32
Removes a specified wire size from the set.
item: The wire size to be erased.
Returns: The number of wire sizes that were erased from the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.Contains(Autodesk.Revit.DB.Electrical.WireSize)
System.Boolean
Tests for the existence of a wire size within the set.
item: The wire size to be searched for.
Returns: The Contains method returns True if the wire size is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.WireSizeSet.Clear
void
Removes every wire size from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.WireSizeSet.Size
System.Int32
get
Returns the number of wire sizes that are in the set.

Autodesk.Revit.DB.Electrical.WireSizeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.